index.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./resource/readtheorg.css" />
#+TITLE: free-math: zhcosin's Home
#+AUTHOR: zhcosin
#+OPTIONS:   ^:{} 
#+LANGUAGE: zh-CN

这里是我(zhcosin)的个人主页，欢迎光临。

[[https://github.com/zhcosin][我的 GitHub 主页]]

E-mail: zhcosin@163.com

* 数学

** 读书
   这里是我比较喜欢的一些数学书籍的列表。
   
  1. 初等数学
     - 《不等式的秘密》 [越南]范建熊，隋振林(译). 哈尔滨工业大学出版社.
     - 《几何瑰宝》 沈文选，杨清桃. 哈尔滨工业大学出版社.
     - 《圆锥曲线论》 [古希腊]阿波罗尼奥斯. 陕西科学技术出版社.
     - [[http://kuing.orzweb.net/viewthread.php?tid%3D3757&extra%3Dpage%253D1][《kuing 网络撸题集》]] kuing. 网络电子书
       
  2. 代数
     - 《高等代数》 北京大学几何与代数教研室前代数小组. 高等教育出版社.
     - 《代数学引论》 [前苏联]柯斯特利金. 高等教育出版社.
     - 《代数学引论》 聂灵沼,丁石孙. 高等教育出版社.
     - 《从一元一次方程到伽罗瓦理论》 冯承天. 华东师范大学出版社.
       
  3. 数论.
     - 《初等数论》 闵嗣鹤,严士健. 高等教育出版社.
     - 《数论导引》 华罗庚. 高等教育出版社.
     - 《初等数论》 潘承洞,潘承彪. 高等教育出版社.
       
  4. 微积分
     - 《微积分学教程》 [前苏联]菲赫金哥尔茨. 高等教育出版社.
     - 《高等数学引论》 华罗庚. 高等教育出版社.
     - 《微积分与数学分析引论》 [美]F.约翰, R.柯朗. 科学出版社.
     - 《数学分析习题集》 [前苏联]吉米诺维奇. 高等教育出版社.
  
** 笔记
   
 1. 《初等数学笔记》 [[https://coding.net/u/zhcosin/p/math-notes-publish/git/blob/master/elementary-math-note.pdf][PDF 下载]]

     这是我在初等数学范围内的一份笔记，开工于2016年4月并维护至今，内容涉及数论、代数、欧氏几何、解析几何、组合数学等，这份笔记的写作动机在于不断完善自己的知识体系，持续提升数学水平。我希望经过数年的添砖加瓦，它能够成为初等数学范围内的一份内容全面丰富、材料广泛的笔记，可以供别人参考。

 2. 《微积分学笔记》 [[https://coding.net/u/zhcosin/p/math-notes-publish/git/blob/master/calculus-note.pdf][PDF 下载]]

     分析学是我非常感兴趣的一门数学分支，而作为其基础课程的微积分，是我一直梦想能深入掌握的一门课，而这份笔记便是记录这个学习过程，目前还在起步阶段，尚未有多少内容。
    
** 一些有用的链接
  
  - [[http://kuing.orzweb.net/viewthread.php?tid%3D3757&extra%3Dpage%253D1][悠闲数学娱乐论坛]]
  - [[https://en.wikipedia.org/wiki/Main_Page][英文维基百科]]  数学知识百科全书

** 数学类软件
   
   1. LaTeX 
      
      =LaTeX= 是一个专业的科技论文、图书排版系统，其排版的数学公式尤其精美，是当今科技排版的标准，我的数学笔记都是用它排版的。下面是一些相关的链接:
      - [[https://www.latex-project.org/][LaTeX 官网]]
      - [[http://www.latexstudio.net/][LaTeX 工作室]]
   
   2. TeXmacs
    
      一个所见即所得的排版系统，可视化的操作方式，却能得到与 =LaTeX= 类似的效果，但软件目前不太成熟，我用它来打草稿和写作讨论稿。
      - [[http://www.texmacs.org/tmweb/home/welcome.en.html][TeXmacs 官网]]
      - [[http://www.yinwang.org/blog-cn/2012/09/18/texmacs][一个真正所见即所得的排版系统]]
      - [[http://x-wei.github.io/TeXmacs_intro.html][学术文章写作利器 - TeXmacs 介绍]]

   3. Maxima

      一个计算机代数系统，类似于 =Mathematica=.

* 计算机
   
** debian 系统 

   一个自由的 =linux= 操作系统的发行版，旨在“自由软件”，这使我可以集中精力在自己的工作上，不受商业软件的广告或者弹窗干扰。下面是一些链接:
   - [[https://www.debian.org/][debian 官网]]
   - [[https://www.debiancn.org/][debian 中文社区]]
     
** vim 与 Emacs

   一个是编辑器之神，一个是神之编辑器，作为两大黑客级别的编辑器，弥漫于两者忠实粉丝之间的“圣战”战火波及到了互联网上所有与编辑器有关的页面上。 =Vim= 的模式编辑方式非常高效，但它的扩展语言 =VimScript= 不如 =Emacs Lisp= 强大，因为后者从属于 =Lisp= 语言族，是一门语法简单但表现力强大的语言， =Emacs= 本质上就是一个编程平台。得益于 =Emacs= 的可扩展性，我使用 =evil= 在 =Emacs= 中来模拟 =Vim= 的编辑方式，这使得工作效率相当高。
   
   另外 =Emacs= 自带的 =org-mode= 模式是一个比 =markdown= 功能更加丰富的文档写作工具，并且得益于 =Emacs Lisp= ，具备高度可定制性，是写作笔记的利器，我用它写作日常文档，包括本页面也是用 =org-mode= 生成的。
   - [[http://www.vim.org/][vim 官网]]
   - [[https://www.gnu.org/software/emacs/][Emacs 官网]]
   - [[https://emacs-china.org/][Emacs 中文社区]]
   - [[http://www.fuzihao.org/blog/2015/02/19/org-mode%25E6%2595%2599%25E7%25A8%258B/][org-mode 入门教程]]     
** Git

   =Git= 是一个分布式版本管理软件，由 =linux= 之父 =Linus Torvalds= 亲手设计和实现，而围绕它的 =GitHub= 网站已经成为全世界的开源项目的集散地，国内也有 =coding.net= 这样的优秀的 =Git= 代码托管平台。我用 =Git= 维护我的所有重要的文档，包括数学笔记、博客文章、软件以及系统的重要配置文件，包括本页面也被纳入 =Git= 的管理之下。
   - [[https://git-scm.com/][Git 官网]]
   - [[http://iissnan.com/progit/][Pro Git 简体中文版]]
   - [[https://github.com/][GitHub]]
   - [[https://coding.net/][Coding.net 代码托管网站]]

* 历史/古典文学
  我喜欢历史和古典文学，以下是一些计划要读的书单。
   - 史记
   - 三国志
   - 资治通鉴
   - 红楼梦
   - 三国演义
   - 东周列国志
