index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>free-math: zhcosin's Home</title>
<!-- 2017-10-23 Mon 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="zhcosin" />
<link rel="stylesheet" type="text/css" href="./resource/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">free-math: zhcosin's Home</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 数学</a>
<ul>
<li><a href="#sec-1-1">1.1. 读书</a></li>
<li><a href="#sec-1-2">1.2. 笔记</a></li>
<li><a href="#sec-1-3">1.3. 一些有用的链接</a></li>
<li><a href="#sec-1-4">1.4. 数学类软件</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 计算机</a>
<ul>
<li><a href="#sec-2-1">2.1. debian 系统</a></li>
<li><a href="#sec-2-2">2.2. vim 与 Emacs</a></li>
<li><a href="#sec-2-3">2.3. Git</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 历史/古典文学</a></li>
</ul>
</div>
</div>
<p>
这里是我(zhcosin)的个人主页，欢迎光临。
</p>

<p>
<a href="https://github.com/zhcosin">我的 GitHub 主页</a>
</p>

<p>
E-mail: zhcosin@163.com
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 数学</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 读书</h3>
<div class="outline-text-3" id="text-1-1">
<p>
这里是我比较喜欢的一些数学书籍的列表。
</p>

<ol class="org-ol">
<li>初等数学
<ul class="org-ul">
<li>《不等式的秘密》 [越南]范建熊，隋振林(译). 哈尔滨工业大学出版社.
</li>
<li>《几何瑰宝》 沈文选，杨清桃. 哈尔滨工业大学出版社.
</li>
<li>《圆锥曲线论》 [古希腊]阿波罗尼奥斯. 陕西科学技术出版社.
</li>
<li><a href="http://kuing.orzweb.net/viewthread.php?tid=3757&extra=page%253D1">《kuing 网络撸题集》</a> kuing. 网络电子书
</li>
<li><a href="https://en.wikipedia.org/wiki/Main_Page">英文维基百科</a>  数学知识百科全书
</li>
</ul>
</li>

<li>代数
<ul class="org-ul">
<li>《高等代数》 北京大学几何与代数教研室前代数小组. 高等教育出版社.
</li>
<li>《代数学引论》 [前苏联]柯斯特利金. 高等教育出版社.
</li>
<li>《代数学引论》 聂灵沼,丁石孙. 高等教育出版社.
</li>
<li>《从一元一次方程到伽罗瓦理论》 冯承天. 华东师范大学出版社.
</li>
</ul>
</li>

<li>数论.
<ul class="org-ul">
<li>《初等数论》 闵嗣鹤,严士健. 高等教育出版社.
</li>
<li>《数论导引》 华罗庚. 高等教育出版社.
</li>
<li>《初等数论》 潘承洞,潘承彪. 高等教育出版社.
</li>
</ul>
</li>

<li>微积分
<ul class="org-ul">
<li>《微积分学教程》 [前苏联]菲赫金哥尔茨. 高等教育出版社.
</li>
<li>《高等数学引论》 华罗庚. 高等教育出版社.
</li>
<li>《微积分与数学分析引论》 [美]F.约翰, R.柯朗. 科学出版社.
</li>
<li>《数学分析习题集》 [前苏联]吉米诺维奇. 高等教育出版社.
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 笔记</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>《初等数学笔记》 <a href="https://coding.net/u/zhcosin/p/math-notes-publish/git/blob/master/elementary-math-note.pdf">PDF 下载</a>

<p>
这是我在初等数学范围内的一份笔记，开工于2016年4月并维护至今，内容涉及数论、代数、欧氏几何、解析几何、组合数学等，这份笔记的写作动机在于不断完善自己的知识体系，持续提升数学水平。我希望经过数年的添砖加瓦，它能够成为初等数学范围内的一份内容全面丰富、材料广泛的笔记，可以供别人参考。
</p>
</li>

<li>《微积分学笔记》 <a href="https://coding.net/u/zhcosin/p/math-notes-publish/git/blob/master/calculus-note.pdf">PDF 下载</a>

<p>
分析学是我非常感兴趣的一门数学分支，而作为其基础课程的微积分，是我一直梦想能深入掌握的一门课，而这份笔记便是记录这个学习过程，目前还在起步阶段，尚未有多少内容。
</p>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 一些有用的链接</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="http://kuing.orzweb.net/viewthread.php?tid=3757&extra=page%253D1">悠闲数学娱乐论坛</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 数学类软件</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>LaTeX 

<p>
<code>LaTeX</code> 是一个专业的科技论文、图书排版系统，其排版的数学公式尤其精美，是当今科技排版的标准，我的数学笔记都是用它排版的。下面是一些相关的链接:
</p>
<ul class="org-ul">
<li><a href="https://www.latex-project.org/">LaTeX 官网</a>
</li>
<li><a href="http://www.latexstudio.net/">LaTeX 工作室</a>
</li>
</ul>
</li>

<li>TeXmacs

<p>
一个所见即所得的排版系统，可视化的操作方式，却能得到与 <code>LaTeX</code> 类似的效果，但软件目前不太成熟，我用它来打草稿和写作讨论稿。
</p>
<ul class="org-ul">
<li><a href="http://www.texmacs.org/tmweb/home/welcome.en.html">TeXmacs 官网</a>
</li>
<li><a href="http://www.yinwang.org/blog-cn/2012/09/18/texmacs">一个真正所见即所得的排版系统</a>
</li>
<li><a href="http://x-wei.github.io/TeXmacs_intro.html">学术文章写作利器 - TeXmacs 介绍</a>
</li>
</ul>
</li>

<li>Maxima

<p>
一个计算机代数系统，类似于 <code>Mathematica</code>.
</p>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 计算机</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> debian 系统</h3>
<div class="outline-text-3" id="text-2-1">
<p>
一个自由的 <code>linux</code> 操作系统的发行版，旨在“自由软件”，这使我可以集中精力在自己的工作上，不受商业软件的广告或者弹窗干扰。下面是一些链接:
</p>
<ul class="org-ul">
<li><a href="https://www.debian.org/">debian 官网</a>
</li>
<li><a href="https://www.debiancn.org/">debian 中文社区</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> vim 与 Emacs</h3>
<div class="outline-text-3" id="text-2-2">
<p>
一个是编辑器之神，一个是神之编辑器，作为两大黑客级别的编辑器，弥漫于两者忠实粉丝之间的“圣战”战火波及到了互联网上所有与编辑器有关的页面上。 <code>Vim</code> 的模式编辑方式非常高效，但它的扩展语言 <code>VimScript</code> 不如 <code>Emacs Lisp</code> 强大，因为后者从属于 <code>Lisp</code> 语言族，是一门语法简单但表现力强大的语言， <code>Emacs</code> 本质上就是一个编程平台。得益于 <code>Emacs</code> 的可扩展性，我使用 <code>evil</code> 在 <code>Emacs</code> 中来模拟 <code>Vim</code> 的编辑方式，这使得工作效率相当高。
</p>
<ul class="org-ul">
<li><a href="http://www.vim.org/">vim 官网</a>
</li>
<li><a href="https://www.gnu.org/software/emacs/">Emacs 官网</a>
</li>
<li><a href="https://emacs-china.org/">Emacs 中文社区</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Git</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>Git</code> 是一个分布式版本管理软件，由 <code>linux</code> 之父 <code>Linus Torvalds</code> 亲手设计和实现，而围绕它的 <code>GitHub</code> 网站已经成为全世界的开源项目的集散地，国内也有 <code>coding.net</code> 这样的优秀的 <code>Git</code> 代码托管平台。我用 <code>Git</code> 维护我的所有重要的文档，包括数学笔记、博客文章、软件以及系统的重要配置文件，包括本页面也被纳入 <code>Git</code> 的管理之下。
</p>
<ul class="org-ul">
<li><a href="https://git-scm.com/">Git 官网</a>
</li>
<li><a href="http://iissnan.com/progit/">Pro Git 简体中文版</a>
</li>
<li><a href="https://github.com/">GitHub</a>
</li>
<li><a href="https://coding.net/">Coding.net 代码托管网站</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 历史/古典文学</h2>
<div class="outline-text-2" id="text-3">
<p>
我喜欢历史和古典文学，以下是一些计划要读的书单。
</p>
<ul class="org-ul">
<li>史记
</li>
<li>三国志
</li>
<li>资治通鉴
</li>
<li>红楼梦
</li>
<li>三国演义
</li>
<li>东周列国志
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#20316;&#32773;: zhcosin</p>
<p class="date">Created: 2017-10-23 Mon 22:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
